In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
g=pd.Series([1,2,3,4,5,6,np.nan,8,9,10])
g

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     NaN
7     8.0
8     9.0
9    10.0
dtype: float64

In [4]:
f=pd.date_range("20001030",periods=10)
f

DatetimeIndex(['2000-10-30', '2000-10-31', '2000-11-01', '2000-11-02',
               '2000-11-03', '2000-11-04', '2000-11-05', '2000-11-06',
               '2000-11-07', '2000-11-08'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df=pd.DataFrame(np.random.randn(10,3),index=f,columns=["A","B","C"])
df

                   A         B         C
2000-10-30  0.311886  0.814486 -0.319131
2000-10-31  0.201663 -0.570876 -1.192250
2000-11-01 -1.336937 -1.002885 -0.617541
2000-11-02 -1.351487  0.956463 -0.191726
2000-11-03  0.645707 -1.800172  2.635171
2000-11-04 -0.415008 -0.776868  0.367415
2000-11-05  0.189199  0.396900  0.805908
2000-11-06  1.660023 -0.999445 -0.236713
2000-11-07 -0.790865  0.687874 -0.736453
2000-11-08 -1.735661  1.069928 -0.377451

In [10]:
d1=pd.DataFrame({
    "A":[1,2,3,4],
    "B":pd.Timestamp("20001010"),
    "C":pd.Series(1,index=list(range(4)),dtype="float32"),
    "D":np.array([5]*4,dtype="int32"),
    "E":pd.Categorical(["true","false","True","False"]),
    "F":"Pandas"
})
d1

   A          B    C  D      E       F
0  1 2000-10-10  1.0  5   true  Pandas
1  2 2000-10-10  1.0  5  false  Pandas
2  3 2000-10-10  1.0  5   True  Pandas
3  4 2000-10-10  1.0  5  False  Pandas

In [11]:
df.to_numpy()

array([[ 0.3118856 ,  0.81448603, -0.31913141],
       [ 0.20166329, -0.57087556, -1.19224961],
       [-1.33693734, -1.00288465, -0.61754104],
       [-1.35148665,  0.95646294, -0.19172646],
       [ 0.64570694, -1.80017173,  2.63517098],
       [-0.41500814, -0.77686801,  0.36741467],
       [ 0.18919852,  0.3968999 ,  0.8059085 ],
       [ 1.66002317, -0.99944547, -0.23671295],
       [-0.79086503,  0.68787415, -0.73645297],
       [-1.73566118,  1.06992789, -0.37745085]])

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 10 entries, 2000-10-30 to 2000-11-08
Freq: D
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     float64
 1   B       10 non-null     float64
 2   C       10 non-null     float64
dtypes: float64(3)
memory usage: 320.0 bytes

In [13]:
df["C"]

2000-10-30   -0.319131
2000-10-31   -1.192250
2000-11-01   -0.617541
2000-11-02   -0.191726
2000-11-03    2.635171
2000-11-04    0.367415
2000-11-05    0.805908
2000-11-06   -0.236713
2000-11-07   -0.736453
2000-11-08   -0.377451
Freq: D, Name: C, dtype: float64

In [14]:
d1.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [15]:
df.dtypes

A    float64
B    float64
C    float64
dtype: object

In [16]:
df.head()

                   A         B         C
2000-10-30  0.311886  0.814486 -0.319131
2000-10-31  0.201663 -0.570876 -1.192250
2000-11-01 -1.336937 -1.002885 -0.617541
2000-11-02 -1.351487  0.956463 -0.191726
2000-11-03  0.645707 -1.800172  2.635171

In [17]:
df.tail()

                   A         B         C
2000-11-04 -0.415008 -0.776868  0.367415
2000-11-05  0.189199  0.396900  0.805908
2000-11-06  1.660023 -0.999445 -0.236713
2000-11-07 -0.790865  0.687874 -0.736453
2000-11-08 -1.735661  1.069928 -0.377451

In [18]:
df[0:2]

                   A         B         C
2000-10-30  0.311886  0.814486 -0.319131
2000-10-31  0.201663 -0.570876 -1.192250

In [20]:
df.loc[f[0]]

A    0.311886
B    0.814486
C   -0.319131
Name: 2000-10-30 00:00:00, dtype: float64

In [23]:
df2=df.reindex(index=f[0:3],columns=list(df.columns)+["E"])
df2.loc[f[0]:f[1], "E"]=1
df2

                   A         B         C    E
2000-10-30  0.311886  0.814486 -0.319131  1.0
2000-10-31  0.201663 -0.570876 -1.192250  1.0
2000-11-01 -1.336937 -1.002885 -0.617541  NaN